       01  test-context.
           02  passes      PIC 9(03) VALUE 0.
           02  fails       PIC 9(03) VALUE 0.
           02  totalRun    PIC 9(03) VALUE 0.
