       01  basket.
           02  item OCCURS 10 TIMES.
               03  unitprice   PIC 9(3)V9(2).
               03  quantity    PIC 9(2).
       01  total   PIC 9(04)V9(2).
